[{"id":"_pg241zdkj","title":"There Is No Settled Mathematics","blogBody":" Naval: There are two other scientific thinkers who I like who come to similar conclusions as Deutsch. \r\n\r\nOne is Nassim Taleb, who popularized the idea of the black swan, which is that no number of white swans disproves the existence of a black swan. You can never conclusively say all swans are white. You can never establish a final truth. All you can do is work with the best explanation you have today, which is still far better than ignorance. At any time a black swan can show up and disprove your theory, and then you have to go find a better one.\r\n\r\nThe other one I find fascinating is Gregory Chaitin. He is a mathematician very much in the vein of Kurt Gödel because he explores the limits and boundaries of what is possible in mathematics. One of the points that he makes is that Gödel’s incompleteness theorem doesn’t say that mathematics is junk; the theorem isn’t a cause for despair. Gödel’s incompleteness theorem says that no formal system—including mathematics—can be both complete and correct. Either there are statements that are true that cannot be proven true in the system, or there will be a contradiction somewhere inside the system.\r\n\r\nThis could be a cause of despair for mathematicians who view mathematics as this abstract, perfect, fully self-contained thing. But Chaitin makes the argument that, actually, it opens up for creativity in mathematics. It means that even in mathematics you are always one step away from falsifying something and then finding a better explanation for it. It puts humans and their creativity and their bid to find good explanations back at the core of it.\r\n\r\nAt some deep level, mathematics is still an art. Of course, very useful things come out of mathematics. You’re still building an edifice of knowledge, but there is no such thing as a conclusive, settled truth. There is no settled science, there is no settled mathematics. There are good explanations that will be replaced over time with more good explanations that explain more of the world.\r\n\r\nBrett: This is something that we inherit from our schooling more than anything else. It’s part of our academic culture, and it bleeds into the wider culture as well. People have this idea that mathematics is this pristine area of knowledge where what is proved to be true is certainly true.\r\n\r\nThen you have science, which doesn’t give you certain truth but you can be highly confident in what you discover. You can use experiments to confirm that what you’re saying appears to be correct, but you might be wrong. And then, of course, there’s philosophy, which is a mere matter of opinion. \r\n\r\nThis is the hierarchy that some people inherit from school: Mathematics is certain, science is almost certain, and the rest of it is more or less a matter of opinion. This is what Deutsch calls the mathematician’s misconception. Mathematicians have this intuitive way of realizing that their proof—the theorem they have reached by this method of proof—is absolutely, certainly true.\r\n\r\nIn fact, it’s a confusion between the subject matter and their knowledge of the subject matter."},{"id":"_ibovbzsjt","title":"There Is No End of Science","blogBody":" Brett: Eddington’s experiment is an excellent example of what’s called a crucial test, which is sort of the pinnacle of what science is all about.\r\n\r\nIf we do a test and it doesn’t agree with a particular theory that we have, that’s problematic. But that doesn’t mean that it refutes the theory. If you were to refute the only theory that you have, where do you jump to? You don’t have any alternative.\r\n\r\nIf we were to do a scientific test tomorrow and it was inconsistent with the theory of general relativity, then what? There is no alternative to general relativity. In fact, there have been experiments over the years that seem to have been inconsistent with general relativity. Guess what? They’ve all turned out to be faulty. If you had to choose between whether or not general relativity has been refuted by your test or your test is flawed, go with the fact that your test is flawed.\r\n\r\nIn the case of Eddington’s experiment, we had two viable theories for gravity. We had Newton’s theory of universal gravitation on the one hand and we had Einstein’s general theory of relativity on the other.\r\n\r\nThe experiment you described of how much the light bends during a solar eclipse is the correct way of describing what happened. It is not that we showed that general relativity was correct in some final sense; rather, we refuted Newton’s theory of gravitation. Newton’s theory was ruled out because it was inconsistent with the test, while general relativity was consistent with the test.\r\n\r\nThis doesn’t mean that general relativity is the final word in science. It means that it’s the best theory we have for now, and there’s a whole bunch of reasons that we might think general relativity ultimately has to be false in the final analysis. This is another aspect of the world view that we never have the final word—and that’s a good thing. That’s optimistic because it means we can keep improving, we can keep making progress, and we can keep discovering new things. There is no end of science.\r\n\r\nPeople have feared that one day progress will come to a halt, that science will end. In fact, we are at the beginning of infinity, and we will always be at the beginning of infinity precisely because we can improve our ideas.\r\n\r\nWe’re fallible human beings. None of our theories is perfect, because we aren’t perfect. The process by which we create knowledge isn’t perfect, either. It’s error-prone.\r\n\r\nSubscribe to Naval"},{"id":"_agy8ap8b7","title":"Good Explanations Are Hard to Vary","blogBody":" Naval: Brett, would you say that a scientific theory is a subset of a good explanation?\r\n\r\nBrett: Yes. They’re the testable kinds of good explanations. Falsifiable theories are actually a dime a dozen. This doesn’t tell you anything about the quality of the explanation you’re being given.\r\n\r\nThe example that’s used in The Fabric of Reality is the grass cure for the common cold. If someone says, “If you eat 1 kg of grass, it will cure your common cold,” then they have a testable theory. The problem is that no one should test it. Why? Because they haven’t explained the mechanism that would enable grass to cure the common cold. And if you do eat 1 kg of grass and it doesn’t cure your cold, they can turn around and say, “1.1 kg might do it.”\r\n\r\nNaval: Right. Or you need a different kind of grass.\r\n\r\nBrett: It’s always testable, but you’re not making any progress.\r\n\r\nNaval: The second piece of a good explanation is that it’s hard to vary. It has to be very precise, and there has to be a good reason for the precision.\r\n\r\nThe famous example used in The Beginning of Infinity is the explanation for why we have seasons. There’s the old Greek explanation that it’s driven by Persephone, the goddess of spring, and when she can leave Hades. There was this whole theory involving gods and goddesses. Not only was that not easily testable, it was very easy to vary. Persephone could have been Nike, and Hades could have been Jupiter or Zeus. It’s very easy to vary that explanation without the predictions changing. \r\n\r\nWhereas, if you look at the axis tilt theory—which says Earth is angled at 23 degrees relative to the sun and therefore we’d expect the sun to rise here in the winter and over there in the summer—the facts of that are very hard to vary. It makes risky and narrow predictions. The axis tilt theory can predict the exact length of summer and winter at different latitudes, and you can test that precisely. \r\n\r\nBeyond it being a creative theory that is testable and falsifiable, it should be hard to vary the pieces of that theory without essentially destroying the theory. And you certainly don’t want to vary it after the fact—like in your grass example, “Oh, it was 1 kg? No, now it’s 1.1, now it’s 1.2.”\r\n\r\nFinally, the predictions that it makes should be narrow and precise, and they should be risky. For example, I believe in relativity it was Eddington who did the experiment and showed that starlight gets bent around an eclipse. And that was a prediction that Einstein had made in relativity, which turned out to be true. That was a risky prediction that took a long time to confirm.\r\n\r\n"}]